//=================================================================================================
//
//	5.08.2011			(Начинаем осваивать FLASH)
//
//=================================================================================================
//

#define CMD_SUCCESS 0
#define TRUE 1
#define FALSE 0

// Начальный адрес сектора для хранения номеров

#define SECTOR_STARTADDR 0x00007000

//	Номер сектора.										   
#define SECTOR_NUM 7


//	Размер сектора

#define SECTOR_SIZE 0x1000
extern "C" {
/**************************************************************************
DOES:    Sets the value of a variable
RETURNS: TRUE for success, FALSE for error
**************************************************************************/
int SetState  (unsigned char*, unsigned short,int  );

/**************************************************************************
DOES:    Gets the value of a variable
RETURNS: TRUE for success, FALSE for error
**************************************************************************/
int GetState  (int  );
}

//**************************************************************************
//		Очистка сектора.
//*************************************************************************

int EraseSector  (	unsigned short  );

// CPU clock in kHz
//#define CPU_CLK 48000		У меня уже есть (Clk_CPU)


//	Закрытие и открытие прерываний

#define DISABLEIRQ __disable_irq();
#define ENABLEIRQ  __enable_irq();


//=================================================================================================

#define IAP_LOCATION 0x7FFFFFF1							//	Адрес запуска функций IAP

typedef void (*IAP)(unsigned int [], unsigned int []);	//	Определили тип указателя
														//	на функцию.

